Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The `@RegisterForReflection` annotation instructs Quarkus to keep the class and its members during the native compilation. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: `@RegisterForReflection` アノテーションは、ネイティブコンパイル時にクラスとそのメンバーを保持するようQuarkusに指示します。 `@RegisterForReflection` アノテーションの詳細については、 link:writing-native-applications-tips.html#registerForReflection[ネイティブアプリケーションのヒント]のページを参照してください。

source: The `@RegisterForReflection` annotation instructs Quarkus to keep the class, its fields, and methods when creating a native executable. This is crucial when we later run our applications as native executables within containers. Without this annotation, the native compilation process would discard the fields and methods during the dead-code elimination phase, which would lead to runtime errors. More details about the `@RegisterForReflection` annotation can be found on the xref:writing-native-applications-tips.adoc#registerForReflection[native application tips] page.
ja_jp: `@RegisterForReflection` アノテーションは、ネイティブ実行可能ファイルを作成するときに、クラス、フィールド、メソッドを保持するよう Quarkus に指示します。 これは、後でアプリケーションをコンテナ内でネイティブ実行可能ファイルとして実行する場合に非常に重要です。 このアノテーションがない場合、ネイティブ・コンパイル・プロセスでは、デッドコード除去の段階でフィールドとメソッドが破棄されるため、実行時エラーが発生します。 `@RegisterForReflection` アノテーションの詳細については、 xref:writing-native-applications-tips.adoc#registerForReflection[ネイティブ・アプリケーションのヒント] ページを参照してください。

source: The `@RegisterRestClient` registers the implementation of the REST Client at runtime, and because the bean needs to be a regular scope, you have to annotate your interface with `@ApplicationScoped`.
ja_jp: `@RegisterRestClient` は、ランタイムに REST Client の実装を登録します。Beanは通常のスコープである必要があるため、インターフェイスに `@ApplicationScoped` アノテーションを付ける必要があります。

source: The `@RegisterRestClient` registers the implementation of the rest-client at runtime, and because the bean needs to be a regular scope, you have to annotate your interface with `@ApplicationScoped`.
ja_jp: `@RegisterRestClient` は、実行時に rest-client の実装を登録しています。Beanは通常のスコープである必要があるため、インターフェイスに `@ApplicationScoped` を付与する必要があります。

source: The `@RequestScoped` scope is required to enable injection of the `birthdate` claim as a `String`.
ja_jp: `birthdate` クレームを `String` として挿入できるようにするには、 `@RequestScoped` スコープが必要です。

source: The `@RolesAllowed` annotation restricts access to users with either the "User" or "Admin" role.
ja_jp: `@RolesAllowed` アノテーションは、ユーザーまたは管理者のロールを持つユーザーへのアクセスを制限します。

source: The `@RolesAllowed` annotation value is set to the value of `Administrator`.
ja_jp: `@RolesAllowed` アノテーション値は、 `Administrator` の値に設定されています。

source: The `@RolesAllowed` annotation value supports xref:config-reference.adoc#property-expressions[property expressions] including default values and nested property expressions. Configuration properties used with the annotation are resolved at runtime.
ja_jp: `@RolesAllowed` アノテーション値は、デフォルト値とネストされたプロパティー式を含む xref:config-reference.adoc#property-expressions[property expressions] をサポートします。 アノテーションで使用される設定プロパティーは実行時に解決されます。

source: The `@Roles` field must either be `String`, `Collection<String>`, or a `Collection<X>`, where `X` is an entity class with a single `String` field annotated as `@RolesValue`.
ja_jp: `@Roles` フィールドは、 `String` 、 `Collection<String>` 、または `Collection<X>` のいずれかである必要があります。 `X` は、 `@RolesValue` としてアノテーションされた単一の `String` フィールドを持つエンティティクラスです。

source: The `@Roles` field must either be of type `String` or `Collection<String>` or alternately a `Collection<X>` where `X` is an entity class with one `String` field annotated with the `@RolesValue` annotation.
ja_jp: `@Roles` フィールドは `String` か `Collection<String>` のいずれかのタイプであるか、または `Collection<X>` である必要があります。 `X` はエンティティークラスで、 `@RolesValue` アノテーションが付与された `String` フィールドが 1 つあります。

source: The `@Route` annotation allows you to configure:
ja_jp: `@Route` アノテーションを使用すると、以下を設定できます。

source: The `@Route` annotation indicates that the method is a reactive route. Again, by default, the code contained in the method must not block.
ja_jp: `@Route` アノテーションは、メソッドがリアクティブルートであることを示します。繰り返しになりますが、デフォルトでは、メソッドに含まれるコードはブロックしてはいけません。

source: The `@Route` annotation is repeatable and so you can declare several routes for a single method:
ja_jp: `@Route` アノテーションは繰り返し可能であるため、1 つのメソッドに対して複数のルートを宣言できます。

source: The `@RunAsUser` annotation creates an identity for scheduled tasks. It does not temporarily replace the current identity.
ja_jp: `@RunAsUser` アノテーションは、スケジュールされたタスクの ID を作成します。現在の ID を一時的に置き換えることはありません。

source: The `@RunOnVirtualThread` annotation can be used together with the link:{rm_blocking_annotation}[@Blocking] annotation to specify a worker name.
ja_jp: `@RunOnVirtualThread` アノテーションは、ワーカー名を指定するための link:{rm_blocking_annotation}[@Blocking] アノテーションと一緒に使用できます。

source: The `@RunOnVirtualThread` annotation instructs Quarkus to invoke the annotated method on a **new** virtual thread instead of the current one. Quarkus handles the creation of the virtual thread and the offloading.
ja_jp: `@RunOnVirtualThread` アノテーションは、Quarkusに対して、現在のスレッドではなく *新しい* 仮想スレッドでアノテーションされたメソッドを呼び出すように指示します。 Quarkusは仮想スレッドの作成とオフロードを処理します。

source: The `@SafeVertxContext` annotation is a CDI interceptor binding annotation. Therefore, it only works for CDI beans and on non-private methods.
ja_jp: `@SafeVertxContext` アノテーションは、CDI インターセプターバインドアノテーションです。 したがって、CDI Bean および非プライベートメソッドに対してのみ機能します。

source: The `@SecureField` annotation is only effective when Quarkus recognizes that produced content type is the 'application/json' type.
ja_jp: `@SecureField` アノテーションは、生成されたコンテンツタイプが 'application/json' タイプであることを Quarkus が認識した場合にのみ有効です。

source: The `@ShouldNotPin` can also be used on methods directly.
ja_jp: `@ShouldNotPin` はメソッドに直接使うこともできます。

source: The `@Singleton` scope is added automatically.
ja_jp: `@Singleton` スコープが自動的に追加されます。

source: The `@Startup` annotation can be also declared on a non-static non-producer no-args method:
ja_jp: `@Startup` アノテーションは、非static、非producer、argsなしメソッドでも宣言できます：

source: The `@TestSecurity` annotation also works with the `@PermissionsAllowed` security annotation. Consider following example:
ja_jp: `@TestSecurity` アノテーションは `@PermissionsAllowed` セキュリティーアノテーションでも機能します。 次の例を見てみましょう。

source: The `@TestSecurity`, `user`, and `roles` attributes are available as `TokenIntrospection`, `username`, and `scope` properties. Use `io.quarkus.test.security.oidc.TokenIntrospection` to add the additional introspection response properties, such as an `email`, and so on.
ja_jp: `@TestSecurity`、 `user`、および `roles` 属性は、 `TokenIntrospection`、 `username`、および `scope` プロパティーとして使用できます。 `io.quarkus.test.security.oidc.TokenIntrospection` を使用して、 `email` などの追加のイントロスペクションレスポンスプロパティーを追加します。

source: The `@Traced` annotation is replaced by the `@WithSpan` annotation but beware that this new annotation will always create a new Span. You shouldn't use it on JAX-RS endpoints and we only have it here for demonstration purposes.
ja_jp: `@Traced` アノテーションは `@WithSpan` アノテーションに置き換えられましたが、この新しいアノテーションは常に新しい Span を作成することに注意してください。JAX-RS エンドポイントでは使用しないでください。ここではデモ目的でのみ使用しています。

source: The `@Traced` annotation is replaced by the `@WithSpan` annotation but beware that this new annotation will always create a new Span. You shouldn't use it on JAX-RS endpoints because they are already instrumented.
ja_jp: `@Traced` アノテーションは `@WithSpan` アノテーションに置き換えられましたが、この新しいアノテーションは常に新しい Span を作成することに注意してください。JAX-RS エンドポイントはすでに計装されているため、使用しないでください。

source: The `@TransactionConfiguration` annotation allows to set a timeout property, in seconds, that applies to transactions created within the annotated method.
ja_jp: `@TransactionConfiguration` アノテーションでは、タイムアウトのプロパティを秒単位で設定できます。それは、アノテーションされたメソッド内で作成されたトランザクションに適用されます。

source: The `@UserDefinition` annotation must be present on a Jakarta Persistence entity, regardless of whether xref:hibernate-orm-panache.adoc[simplified Hibernate ORM with Panache] is used or not.
ja_jp: `@UserDefinition` アノテーションは、 xref:hibernate-orm-panache.adoc[簡略化されたHibernate ORM with Panache] が使用されているかどうかに関係なく、Jakarta Persistenceエンティティに存在する必要があります。

source: The `@UserDefinition` annotation must be present on a single entity and can be either a regular Hibernate ORM entity or a Hibernate ORM with Panache entity.
ja_jp: アノテーション `@UserDefinition` は単一のエンティティに存在する必要があり、通常の Hibernate ORM エンティティまたは Panache 付き Hibernate ORM エンティティのいずれかにすることができます。

source: The `@UserDefinition` annotation must be present on a single entity, either a regular Hibernate ORM entity or a Hibernate ORM with Panache entity.
ja_jp: `@UserDefinition` アノテーションは、通常の Hibernate ORM エンティティまたは Hibernate ORM with Panache エンティティのいずれか、単一のエンティティ上に存在する必要があります。

source: The `@UserDefinition` annotation must be present on a single entity, either a regular Hibernate ORM entity or a Hibernate ORM with a Panache entity.
ja_jp: `@UserDefinition` アノテーションは、通常の Hibernate ORM エンティティまたは Hibernate ORM with a Panache エンティティのいずれか、単一のエンティティのみに存在する必要があります。

source: The `@UserDefinition` class must be a JPA entity (with Panache or not).
ja_jp: `@UserDefinition` クラスは JPA エンティティーである必要があります(Panache を使用しているかどうかは問いません)。

source: The `@Username` and `@Password` field types are always `String`.
ja_jp: `@Username` と `@Password` のフィールドの型は常に `String` です。

source: The `@Username` and `@Password` field types must be of type `String`.
ja_jp: `@Username` と `@Password` フィールドの型は `String` でなければなりません。

source: The `@WithConverter` annotation provides a way to set a `Converter` to use in a specific mapping:
ja_jp: `@WithConverter` アノテーションは、特定のマッピングで使用する `Converter` を設定する方法を提供します。

source: The `@WithDefault` annotation allows to set a default property into a mapping (and prevent and error if the configuration value is not available in any `ConfigSource`):
ja_jp: `@WithDefault` アノテーションにより、デフォルトのプロパティをマッピングに設定することができます（また、設定値がどの `ConfigSource` においても利用できない場合はエラーになりません）。

source: The `@WithParentName` annotation allows the configuration mapping property to inherit its container name, simplifying the configuration property name required to match the mapping:
ja_jp: `@WithParentName` アノテーションは、コンフィギュレーション・マッピング・プロパティがそのコンテナ名を継承することを可能にし、マッピングに一致させるために必要なコンフィギュレーション・プロパティ名を単純化します：

source: The `@WithParentName` annotation allows to configurations mapping to inherit its container name, simplifying the configuration property name required to match the mapping:
ja_jp: `@WithParentName` アノテーションを使用すると、設定マッピングがそのコンテナー名を継承できるようになり、マッピングに一致させるために必要な設定プロパティ名が簡素化されます:

source: The `@WithParent` annotation allows to configurations mapping to inherit its container name, simplifying the configuration property name required to match the mapping:
ja_jp: `@WithParent` アノテーションにより、設定のマッピングがそのコンテナ名を継承するようになり、マッピングに合わせて必要な設定プロパティ名が簡素化されます。

source: The `@WithTransaction` annotation will also work for testing. This means that changes done during the test will be propagated to the database. If you want any changes made to be rolled back at the end of the test you can use the `io.quarkus.test.TestReactiveTransaction` annotation. This will run the test method in a transaction, but roll it back once the test method is complete to revert any database changes.
ja_jp: `@WithTransaction` アノテーションもテストに使用できます。 これは、テスト中に行われた変更がデータベースに伝播されることを意味します。 テスト終了時に変更をロールバックする場合は、 `io.quarkus.test.TestReactiveTransaction` アノテーションを使用できます。 これにより、トランザクション内でテストメソッドが実行されますが、テストメソッドが完了するとロールバックされ、データベースの変更が元に戻ります。

source: The `@io.quarkus.arc.config.ConfigProperties` annotation is able to group multiple related configuration values in its own class:
ja_jp: `@io.quarkus.arc.config.ConfigProperties` アノテーションは、複数の関連する設定値を独自のクラスにまとめることができます。

source: The `@io.quarkus.cache.CachedResults` qualifier may be applied to injection points to instruct the container to inject a _generated wrapper bean_ that delegates all method invocations to the original bean but the return values of selected business methods are cached. By default, all non-void non-static business methods are included. However, it is possible to exclude methods whose names match one of the regular expressions defined by `@CachedResults#exclude()`. The injected class must be either an interface or declare a no-args constructor.
ja_jp: `@io.quarkus.cache.CachedResults` 修飾子はインジェクションポイントに適用でき、コンテナーに _生成されたラッパー Bean_ をインジェクトするよう指示します。このラッパー Bean は、すべてのメソッド呼び出しを元の Bean に委譲しますが、選択されたビジネスメソッドの戻り値はキャッシュされます。デフォルトでは、すべての void でない非 static なビジネスメソッドが含まれます。ただし、`@CachedResults#exclude()` で定義された正規表現のいずれかに一致する名前を持つメソッドを除外することも可能です。インジェクトされるクラスは、インターフェースであるか、引数なしコンストラクターを宣言している必要があります。

source: The `@io.quarkus.runtime.ShutdownDelayInitiated` annotation is used to mark a business method of a CDI bean that should be executed when the shutdown delay initiates. The annotated method must be non-private and non-static and declare no arguments. Furthermore, `quarkus.shutdown.delay-enabled` configuration needs to be set to `true`.
ja_jp: `@io.quarkus.runtime.ShutdownDelayInitiated` アノテーションは、シャットダウン遅延が開始されるときに実行されるべき CDI Bean のビジネスメソッドをマークするために使用されます。アノテーションされたメソッドは、非プライベート、非静的であり、引数を宣言しない必要があります。さらに、`quarkus.shutdown.delay-enabled` 設定を `true` に設定する必要があります。

source: The `@io.quarkus.runtime.Shutdown` annotation is used to mark a business method of a CDI bean that should be executed during application shutdown. The annotated method must be non-private and non-static and declare no arguments. The behavior is similar to a declaration of a `ShutdownEvent` observer. The following examples are functionally equivalent.
ja_jp: `@io.quarkus.runtime.Shutdown` アノテーションは、アプリケーションのシャットダウン中に実行されるべき CDI Bean のビジネスメソッドをマークするために使用されます。アノテーションされたメソッドは、非プライベートかつ非静的で、引数を宣言しない必要があります。動作は、 `ShutdownEvent` オブザーバの宣言に似ています。以下の例は、機能的に同等です。

source: The `@io.quarkus.websockets.next.OnError` annotation can be also used to declare a global error handler, i.e. a method that is not declared on a WebSocket endpoint. Such a method may not accept `@PathParam` parameters. Error handlers declared on an endpoint take precedence over the global error handlers.
ja_jp: `@io.quarkus.websockets.next.OnError` アノテーションは、グローバルエラーハンドラー、つまり WebSocket エンドポイントで宣言されていないメソッドを宣言するためにも使用できます。このようなメソッドは、 `@PathParam` パラメーターを受け入れない場合があります。エンドポイントで宣言されたエラーハンドラーは、グローバルエラーハンドラーよりも優先されます。

source: The `AgentEmitter` interface provides the same functionality with a cleaner API.
ja_jp: `AgentEmitter` インターフェースは、よりクリーンな API で同等の機能を提供します。

source: The `Ally` type was added and it implements `Character`
ja_jp: `Ally` 型が追加され、 `Character` を実装しています。

source: The `AmazingService` is created during injection.
ja_jp: `AmazingService` は注入時に作成されます。

source: The `Amazon Alexa` extension adds dependent libraries from the Alexa SDK that are used in Jackson JSON transformations, in order for the reflective classes to identified and included at `BUILD_TIME`.
ja_jp: `Amazon Alexa` エクステンションは、Jackson JSON 変換で使用される依存関係ライブラリーを Alexa SDK から追加し、リフレクションクラスが `BUILD_TIME` で識別および含まれるようにします。

source: The `AppConfig` can be injected as a mock into a Quarkus test class with `@Inject`:
ja_jp: `AppConfig` は、モックとして `@Inject` でQuarkusのテストクラスに注入することができます。

source: The `Auth0` Login Flow diagram should look like this now:
ja_jp: `Auth0` ログインフロー図は次のようになります。

source: The `Character` interface was defined with the getters as fields
ja_jp: ゲッターをフィールドとする `Character` インターフェイスが定義されました。

source: The `ConfigSourceInterceptorFactory` may initialize an interceptor with access to the current chain (so it can be used to configure the interceptor and retrieve configuration values) and set the priority.
ja_jp: `ConfigSourceInterceptorFactory` は、（インターセプターの設定や設定値の取得に使用できるように）現在のチェーンにアクセスし、インターセプターを初期化し、優先度を設定することができます。

source: The `ConstraintProvider` scales an order of magnitude better than the `EasyScoreCalculator`: __O__(n) instead of __O__(n²).
ja_jp: `ConstraintProvider` は、のスケーリングは `EasyScoreCalculator` より桁違いに優れており、__O__(n²) ではなく __O __(n) です。

source: The `CoolService` is a normal scoped bean so we have to invoke a method upon the injected proxy to force the instantiation.
ja_jp: `CoolService` は通常のスコープ付き Bean であるため、強制的にインスタンス化するために挿入されたプロキシーにメソッドを呼び出さなければなりません。

source: The `CoolService` is a normal scoped bean, so we have to invoke a method upon the injected proxy to force the instantiation.
ja_jp: `CoolService` は通常のスコープ付き Bean であるため、強制的にインスタンス化するために挿入されたプロキシーにメソッドを呼び出さなければなりません。

source: The `CuratedApplication` can then be used to create an `AugmentAction` instance, which can create production application and start/restart runtime ones. This application instance exists within an isolated ClassLoader, it is not necessary to have any of the Quarkus deployment classes on the class path as the curate process will resolve them for you.
ja_jp: 次に、 `CuratedApplication` を使用して `AugmentAction` インスタンスを作成し、本番アプリケーションを作成したり、ランタイムのものを起動/再起動したりすることができます。このアプリケーションインスタンスは、分離された ClassLoader 内に存在しています。収集処理によって解決されるため、クラスパスに Quarkus デプロイメントクラスを配置する必要はありません。

source: The `CustomPermission` needs to be granted to the `SecurityIdentity` created by the `@TestSecurity` annotation with a `SecurityIdentityAugmentor` CDI bean:
ja_jp: `SecurityIdentityAugmentor` CDI Bean を使用した `@TestSecurity` アノテーションによって 作成された`SecurityIdentity` に `CustomPermission` を付与する必要があります。

source: The `DistributionSummary` from Micrometer is transformed into a `Histogram` and a `DoubleGauge` for the `max` value. If service level objectives (slo) are set to `true` when creating a `DistributionSummary`, an additional histogram is created for them.
ja_jp: Micrometer の `DistributionSummary` は、`max` 値の `Histogram` と `DoubleGauge` に変換されます。`DistributionSummary` の作成時にサービスレベル目標 (slo) が `true` に設定されている場合、追加のヒストグラムが作成されます。

source: The `Dockerfile` created by Quarkus by default needs one adjustment for the `aggregator` application in order to run the Kafka Streams pipeline. To do so, edit the file `aggregator/src/main/docker/Dockerfile.jvm` and replace the line `FROM fabric8/java-alpine-openjdk8-jre` with `FROM fabric8/java-centos-openjdk8-jdk`.
ja_jp: Quarkusがデフォルトで作成した `Dockerfile` は、Kafka Streamsパイプラインを実行するために、 `aggregator` アプリケーションに1つの調整が必要です。そのためには、 `aggregator/src/main/docker/Dockerfile.jvm` ファイルを編集して、 `FROM fabric8/java-alpine-openjdk8-jre` の行を `FROM fabric8/java-centos-openjdk8-jdk` に置き換えます。

source: The `Emitter` configuration is done the same way as the other stream configuration used by `@Incoming` and `@Outgoing`.
ja_jp: `Emitter` の設定は、 `@Incoming` と `@Outgoing` で使用される他のストリーム設定と同じ方法で行われます。

source: The `Engine` is able to cache the template definitions so that it's not necessary to parse the contents again and again. In Quarkus, the caching is done automatically.
ja_jp: `Engine` はテンプレート定義をキャッシュすることができるので、何度も内容をパースする必要がありません。Quarkus では、キャッシュは自動的に行われます。

source: The `Event.fireAsync()` method returns a `CompletionStage` that completes when all observers are notified. If all observers were notified successfully, the `CompletionStage` completes with the event payload. If some observers have thrown an exception, the `CompletionStage` completes exceptionally with a `CompletionException`.
ja_jp: `Event.fireAsync()` メソッドは、すべてのオブザーバーに通知されると完了する `CompletionStage` を返します。 すべてのオブザーバーに正常に通知された場合、 `CompletionStage` はイベントペイロードで完了します。 一部のオブザーバーで例外が発生した場合、 `CompletionStage` は `CompletionException` で例外的に完了します。

source: The `EventBus` object provides methods to:
ja_jp: `EventBus` オブジェクトは、以下のメソッドを提供します。

source: The `ExtensionsResourceTest` test class needs to be annotated like so:
ja_jp: `ExtensionsResourceTest` クラスには、以下のようなアノテーションが必要です。

source: The `ExtensionsResource` becomes:
ja_jp: `ExtensionsResource` は次のようになります。

source: The `FileConfig` class is annotated with `@ConfigGroup` to indicate that this is an aggregate configuration object containing a collection of configurable properties, rather than being a simple configuration key type.
ja_jp: `FileConfig` クラスには `@ConfigGroup` アノテーションが付けられており、これが単純な設定キータイプではなく、設定可能なプロパティーのコレクションを含む集約された設定オブジェクトであることを示しています。

source: The `Fruit#from` method converts a `Row` instance to a `Fruit` instance. It is extracted as a convenience for the implementation of the other data management methods.
ja_jp: `Fruit#from` メソッドは `Row` インスタンスを `Fruit` インスタンスに変換します。これは、他のデータ管理方法の実装の便宜上、展開されています。

source: The `Fruit#from` method converts a `Row` instance to a `Fruit` instance. It is extracted as a convenience for the implementation of the other data management methods:
ja_jp: `Fruit#from` メソッドは `Row` インスタンスを `Fruit` インスタンスに変換します。これは、他のデータ管理方法の実装の便宜のために展開されています。

source: The `FruitRepository` above extends Spring Data's `org.springframework.data.repository.CrudRepository` which means that all of the latter's methods are available to `FruitRepository`. Additionally `findByColor` is defined whose purpose is to return all Fruit entities that match the specified color.
ja_jp: 上記の `FruitRepository` は、Spring Data の `org.springframework.data.repository.CrudRepository` を拡張します。これは、後者のすべてのメソッドが `FruitRepository` で使用できることを意味します。さらに、指定された色に一致するすべての Fruit エンティティーを返すことを目的とした `findByColor` が定義されています。

source: The `FruitRepository` above extends Spring Data's `org.springframework.data.repository.CrudRepository` which means that all the latter's methods are available to `FruitRepository`. Additionally `findByColor` is defined whose purpose is to return all Fruit entities that match the specified color.
ja_jp: 上記の `FruitRepository` は、Spring Data の `org.springframework.data.repository.CrudRepository` を拡張します。これは、後者のすべてのメソッドが `FruitRepository` で使用できることを意味します。さらに、指定された色に一致するすべての Fruit エンティティーを返すことを目的とした `findByColor` が定義されています。

source: The `Fruit` objects will be automatically serialized/deserialized by https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] or https://github.com/FasterXML/jackson[Jackson], depending on the extension you chose when initializing the project.
ja_jp: `Fruit` オブジェクトは、プロジェクトの初期化時に選択したエクステンションに応じて、 https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] または link:https://github.com/FasterXML/jackson[Jackson] によって自動的にシリアライズ/デシリアライズされます。

source: The `FruitsRepository` above extends Spring Data's `org.springframework.data.repository.CrudRepository` which means that all of the latter's methods are available to `FruitsRepository`.
ja_jp: 上記の `FruitsRepository` はSpring Dataの `org.springframework.data.repository.CrudRepository` を継承しています。つまり、後者のメソッドはすべて `FruitsRepository` で利用可能です。

source: The `FruitsRepository` above extends Spring Data's `org.springframework.data.repository.CrudRepository` which means that all the latter's methods are available to `FruitsRepository`.
ja_jp: 上記の `FruitsRepository` は、Spring Dataの `org.springframework.data.repository.CrudRepository` を拡張しており、後者のメソッドはすべて `FruitsRepository` で利用できることを意味しています。

source: The `GenericDatumReader` also needs a bit of work as it touches threads at build time.
ja_jp: また、 `GenericDatumReader` は、ビルド時にスレッドに触れるため、少し作業が必要です。

source: The `GetWeatherStationDataResult` type must be adjusted accordingly:
ja_jp: `GetWeatherStationDataResult` のタイプは、それに合わせて調整する必要があります:

source: The `GitHubProfileService` has now become a JAX-RS REST class:
ja_jp: `GitHubProfileService` は JAX-RS REST クラスになりました。

source: The `GreetingController` above was an example of a very simple endpoint. In many cases however it is required to return JSON content. The following example illustrates how that could be achieved using a Spring RestController:
ja_jp: 上の `GreetingController` は、非常にシンプルなエンドポイントの例でした。しかし、多くの場合、JSONコンテンツを返さなければなりません。次の例では、Spring RestControllerを使用して、これを実現しています。

source: The `GreetingService` bean will be injected into the test
ja_jp: `GreetingService` Beanがテストに注入されます。

source: The `Greeting` table will have one column, a field called `name`.
ja_jp: `Greeting` テーブルには `name` というフィールドの列が 1 つあります。

source: The `Hero` type was updated to implement `Character`
ja_jp: `Hero` 型を更新して `Character` を実装しました。
